In [1]:
!pip install mysql-connector

Requirement already satisfied: mysql-connector in c:\users\aayush\anaconda3\lib\site-packages (2.2.9)

In [3]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password=""
)
db = database.cursor() 
db.execute("CREATE DATABASE pythons3")

In [6]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = 'class8am'
)
db = database.cursor()

In [7]:
db.execute("SELECT * FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram Chandra', 89.0, 90.0, 98.0, 78.0, 76.0, 423.0, 85.0, 'A')
(2, 'Sabin KC', 89.0, 96.0, 56.0, 78.0, 98.0, 450.0, 84.0, 'A')
(3, 'Anmol KC', 89.0, 67.0, 98.0, 67.0, 87.0, 450.0, 82.5, 'A')
(4, 'Roshani', 69.0, 67.0, 98.0, 67.0, 87.0, 450.0, 82.5, 'A')

In [8]:
db.execute("SELECT sn,name,total,grade FROM student")
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram Chandra', 423.0, 'A')
(2, 'Sabin KC', 450.0, 'A')
(3, 'Anmol KC', 450.0, 'A')
(4, 'Roshani', 450.0, 'A')

In [10]:
sql = '''INSERT INTO student (sn, name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES (12, 'Krishna', 78, 87, 56, 45, 89, 400, 80, 'A');'''
db.execute(sql)
database.commit()

In [ ]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = 'class8am'
)
db = database.cursor()

physics = float(input("Enter physics = "))
chemistry = float(input("Enter chemistry = "))
math = float(input("Enter math = "))
english = float(input("Enter english = "))
nepali = float(input("Enter nepali = "))

total = physics+chemistry+math+english+nepali
per = total/5
if per>=80:
    grade = 'A'
elif per>= 60:
    grade = 'B'
elif per >= 45:
    grade = 'C'
else:
    grade = 'F'
    
sql = f'''INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) 
VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}');'''
db.execute(sql)
database.commit()

In [11]:
# Delete
sql = "DELETE FROM student WHERE sn = 12 "
db.execute(sql)
database.commit()

In [ ]:
# Update
sql = "UPDATE student SET name = 'Krish' WHERE name = 'Krishna'"
db.execute(sql)
database.commit()